In [1]:
from pydbgen import pydb

In [2]:
myDB=pydb()

In [3]:
for _ in range(10):
    print(myDB.simple_ph_num())

887-444-9825
490-649-6168
582-862-0113
111-156-1848
144-088-8018
326-391-5728
639-441-2962
695-723-7108
329-504-6859
949-008-7779

In [4]:
for _ in range(10):
    print(myDB.license_plate())

BLU-8148
EJB-5025
EFQ-011
2ZIL229
YUV-0203
CWC-1152
BWC-477
JAI-7274
7KUI941
YBL-9092

In [5]:
for _ in range(10):
    print(myDB.realistic_email('Tirtha Sarkar'))

Tirtha.S@mail.com
TSarkar22@outlook.com
TirthaSarkar@protonmail.com
Sarkar.Tirtha@protonmail.com
Tirtha.Sarkar@verizon.com
Tirtha_Sarkar@gmail.com
Tirtha_Sarkar@gmail.com
TSarkar69@yahoo.com
Tirtha_S@zoho.com
TirthaSarkar@att.com

In [6]:
for _ in range(10):
    print(myDB.city_real())

Redland
Swannanoa
El Granada
Carrabassett
White Signal
Mannington
Mentmore
Onawa
East Keansburg
Harriet

In [7]:
se=myDB.gen_data_series(num=5)
print(se)

0    Joel Hernandez
1       Lisa Gamble
2        Linda Lang
3     Bethany Brown
4    Shane Castillo
dtype: object

In [8]:
se=myDB.gen_data_series(num=-2)
print(se)

Please input a positive integer for the number of examples
None

In [9]:
se=myDB.gen_data_series(num=2.3)
print(se)

0    Alexandra Mitchell
1             Paul Rice
dtype: object

In [10]:
se=myDB.gen_data_series(num=-2.3)
print(se)

Please input a positive integer for the number of examples
None

In [11]:
se=myDB.gen_data_series(num='hello')
print(se)

Number of samples not understood, terminating...
None

In [12]:
se=myDB.gen_data_series(num=[2,3])
print(se)

Number of samples not understood, terminating...
None

In [13]:
se=myDB.gen_data_series(data_type='date')
print(se)

0    1994-04-21
1    2000-12-26
2    1975-04-22
3    1984-05-26
4    1974-08-07
5    1978-08-06
6    2002-06-17
7    1984-10-20
8    1987-01-02
9    1998-04-12
dtype: object

In [14]:
se=myDB.gen_data_series(data_type=12)
print(se)

Data type not understood. No series generated
None

In [15]:
testdf=myDB.gen_dataframe(fields=['name','ssn','job_title'])
testdf

                name          ssn                      job_title
0      Steven Butler  717-95-2572                        Midwife
1       Nancy Graves  468-84-0874                      Herbalist
2    Lauren Castillo  014-10-3254          Geneticist, molecular
3    Nicole Mcdaniel  789-48-7745      Conference centre manager
4         Ashley Lee  199-20-7685       Public relations officer
5       Mason Farley  049-72-2079              Company secretary
6      Jonathan Bond  038-80-8005          Clinical psychologist
7  Patrick Waters MD  495-72-6656           Journalist, magazine
8     Katherine Mora  003-32-9889            Solicitor, Scotland
9    Cheyenne Parker  409-77-7577  Interior and spatial designer

In [16]:
testdf=myDB.gen_dataframe(-4,fields=['name','email','city'])
testdf

Please input a positive integer for the number of examples

In [17]:
testdf=myDB.gen_dataframe('5',fields=['name','email','city'])
testdf

               name                         email         city
0    Gerald Stewart        GStewart54@verizon.com  Point Arena
1  Christopher Neal  Neal.Christopher@outlook.com      Sumrall
2        Bryan Hall        Bryan.Hall@comcast.net       Westel
3        Adam Bates            Adam.Bates@att.com  Girardville
4    Joshua Vincent         Joshua_V69@yandex.com     Narberth

In [ ]:
myDB.gen_table(20,fields=['name','city','job_title','phone','company'],
          db_file='TestDB.db',table_name='People')

In [ ]:
myDB.gen_excel(15,fields=['name','year','email','license_plate'],filename='TestExcel.xlsx')

In [ ]:
myDB.gen_table(20,fields=['name','city','job_title','phone','company'],
          db_file='TestDB.db',table_name='People', primarykey='age')

In [ ]:
myDB.gen_table(20,fields=['name','city','job_title','phone','company'],
          db_file='TestDB.db',table_name='People', primarykey=12)

In [ ]:
myDB.gen_table(20,fields=['name','city','job_title','phone','company','email'],
          db_file='TestDB.db',table_name='People', primarykey='city',real_city=True,real_email=False,phone_simple=False)